docs/state_machines/mmd/en/sessions/state_Reregistration.mmd
stateDiagram-v2
  direction LR

  state "Created" as pending
  state "Active" as active
  state "Finished" as ended

  [*] --> pending
  pending --> active : Start
  active --> ended : Stop
